package dionis.utils;

import java.util.Collections;
import java.util.HashMap;
import java.util.Map;

/**
 * Константы для работы с данными "Дионис"
 * 
 * @author Ярных А.О.
 * 
 */
public interface Constants {

	/** Скорости порта **/
	String[] PORT_SPEED = { "50", "75", "110", "134.5", "150", "300", "600",
			"1200", "1800", "2000", "2400", "3600", "4800", "7200", "9600",
			"19200", "14400", "38400", "57600", "115200" };
	/** Управление порта **/
	String[] PORT_CONTROL = { "XON/XOFF", "RTS/CTS" };
	/** Тип направления передачи порта **/
	String[] PORT_TYPE = { "входной", "выходной", "динамический" };
	/** Количество бит **/
	String[] BIT_COUNT = { "7", "8" };
	/** Проверка фрейма - чётность, нечётность **/
	String[] PORT_FRAME_CHECK = { "NONE", "ODD", "EVEN", "MARK", "SPACE" };
	/** Стоп-бит **/
	String[] PORT_FRAME_STOP = { "1", "1.5", "2" };

	/** Базовые константы - Кластер - Режим работы **/
	String[] CLUSTER_MODE = { "Нет", "Master", "Slave" };

	/** Параметры удалённого управления **/
	String[] REMOTE_MODE = { "просмотр", "управление", "захват" };

	/** Уведомление администратора **/
	String[] NOTIFY_ADMIN = { "нет", "через 3", "через 9", "через 21" };
	/** Блокирование клиента **/
	String[] FREEZE_CLIENT = { "нет", "через 3", "через 9", "через 21" };

	/** Служба времени **/

	Map<String, String> TIME_ZONES = Collections
			.unmodifiableMap(new HashMap<String, String>() {
				{
					put("-12:00", "Эневеток, Кваджалейн");
					put("-11:00", "о.Мидуэй, Самоа");
					put("-10:00", "Гавайи");
					put("-09:00", "Аляска");
					put("-08:00", "Тихоокеанское время (США и Канада)");
					put("-07:00", "Горное время (США и Канада), Аризона");
					put("-06:00", "Мехико, Тегусигальпа");
					put("-06:00", "Саскачеван");
					put("-06:00", "Центральное время (США и Канада)");
					put("-05:00", "Богота, Лима, Киото");
					put("-05:00", "Восточное время (США и Канада)");
					put("-05:00", "Индиана (восток)");
					put("-04:00", "Атлантическое время (Канада)");
					put("-04:00", "Каракас, Ла Пас");
					put("-04:00", "Сантьяго");
					put("-03:30", "Ньюфаундленд");
					put("-03:00", "Бразилия");
					put("-03:00", "Буэнос-Айрес, Джорджтаун");
					put("-02:00", "Среднеатлантическое время");
					put("-01:00", "Азорские о-ва, о.Кабо-Верде");
					put("+00:00", "Время по Гринвичу: Дублин, Лондон");
					put("+00:00", "Лиссабон, Эдинбург, Касабланка");
					put("+01:00", "Прага, Вильнюс, София");
					put("+02:00", "Калининград");
					put("+03:00", "Москва, Санкт-Петербург, Волгоград");
					put("+04:00", "Самара, Ижевск");
					put("+04:30", "Кабул");
					put("+05:00", "Екатеринбург, Салехард, Оренбург, Уфа");
					put("+05:30", "Бомбей, Калькутта, Мадрас, Нью-Дели");
					put("+06:00", "Омск, Томск, Новосибирск, Алтай");
					put("+07:00", "Дудинка, Тура, Красноярск, Хакасия");
					put("+08:00", "Иркутск, Усть-Ордынский, Улан-Удэ");
					put("+09:00", "Якутск, Чита, Агинское, Благовещенск");
					put("+09:30", "Аделаида, Дарвин");
					put("+10:00", "Владивосток, Сахалин, Биробиджан");
					put("+10:00", "Канберра, Мельбурн, Сидней");
					put("+11:00", "Магадан");
					put("+12:00", "Камчатка, Фиджи, Маршалловы о-ва");
				}
			});
}
